// ======================================================
// IDynamicCollisionContext.cs
// 作成者   : 高橋一翔
// 作成日時 : 2025-12-21
// 更新日時 : 2025-12-21
// 概要     : OBB を更新する動的衝突コンテキストの共通インターフェース
// ======================================================

namespace CollisionSystem.Interface
{
    /// <summary>
    /// 動的衝突コンテキストの共通インターフェース
    /// </summary>
    public interface IDynamicCollisionContext
    {
        // ======================================================
        // プロパティ
        // ======================================================

        /// <summary>
        /// 衝突判定に使用する OBB データ
        /// </summary>
        IOBBData OBB { get; }

        // ======================================================
        // メソッド
        // ======================================================

        /// <summary>
        /// 毎フレーム呼び出される OBB 更新処理
        /// </summary>
        void UpdateOBB();
    }
}