// ======================================================
// IStaticCollisionContext.cs
// 作成者   : 高橋一翔
// 作成日時 : 2025-12-21
// 更新日時 : 2025-12-21
// 概要     : OBB を更新しない静的衝突コンテキストの共通インターフェース
// ======================================================


namespace CollisionSystem.Interface
{
    /// <summary>
    /// 静的衝突コンテキストの共通インターフェース
    /// </summary>
    public interface IStaticCollisionContext
    {
        // ======================================================
        // プロパティ
        // ======================================================

        /// <summary>
        /// 衝突判定に使用する固定 OBB データ
        /// </summary>
        IOBBData OBB { get; }
    }
}